w7d4/app/controllers/api/pokemon_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index
    @pokemon = Pokemon.all

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @pokemon = Pokemon.find(params[:id])